app/controllers/posts_controller.rb

 def create
   @post = Post.new(post_params)
 if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "heya"], ["content", "heyafad"], ["created_at", "2019-05-07 07:36:05.435597"], ["updated_at", "2019-05-07 07:36:05.435597"], ["user_id", 1]]